greeting = 'Здравствуйте, дорогой учитель!' \
           '\nЭтот опросник непростой. На основании ваших ответов и предпочтений он предложит Вам список интересных материалов для профессионального развития.' \
           '\n\nРекомендации будут подобраны по 5 направлениям:' \
           '\n🖥️ цифровизация (для работы и профессионального общения);' \
           '\n📚 методика преподавания;' \
           '\n👩‍🏫 психолого-педагогическая компетенция;' \
           '\n💬 современная коммуникация и 📜 юридическая грамотность.' \
           '\n\nДля начала теста нажмите /begin, для вывода подсказки /help'
help = 'Это бот-опросник. Он предлагает рекомендации, как повысить свою квалификацию и просто хорошо провести время.' \
       '\nДля начала опроса нажмите на команду /begin' \
       '\nЕсли Вы хотите пройти тест ещё раз и получить новые рекомендации, нажмите команду /reset'
in_progress = 'Вы проходите тест'
reset_text = 'Прогресс сброшен, Вы можете получить новые рекомендации пройдя тест /begin'
lets_start_text = 'Для настройки рекомендаций просим Вас ответить на 10 вопросов.' \
                  '\n\nОни появляются с номерами ответов и клавиатурой под сообщением. Выбирайте те ответы, которые кажутся Вам наиболее подходящими.'
recommendation_text = 'Отлично!' \
                      '\nДля Вас собраны рекомендации по 5 направлениям:' \
                      '\n🖥️ Цифровизация, чтобы просмотреть нажмите /zyfra' \
                      '\n📚 Методика - /method' \
                      '\n👩‍🏫 Психолого-педагогическая работа  -  \n/psy_ped' \
                      '\n💬 Коммуникация - /communication' \
                      '\n📜 Юридическая грамотность - /legal' \
                      '\n\nВы можете закрепить это сообщение, чтобы быстро обращаться к каждому блоку. Оно также появится при вызове команды /begin'

zyfra_preamble = '🖥️ *ЦИФРА*\n\nВсе говорят, что цифровизация – это очень важно, обязательно нужно иметь навыки работы с ' \
                 'разнообразными программами. Для учителя важнее всего то, что позволит сделать объемную работу быстрее: составлять КТП и ' \
                 'рабочую программу, быстро делать интерактивную презентацию-игру и так далее.' \
                 '_Общие рекомендации_\n' \
                 '✨Большие языковые модели становятся важным помощником, но только если их грамотно использовать и  ' \
                 'задавать правильные вопросы. Абсолютно всем рекомендуем пройти' \
                 ' бесплатный курс [«Как работать с LLV GigaChat. Часть 1»](https://courses.sberuniversity.ru/llm-gigachat/).\n' \
                 '✨В качестве развлечения предлагаем попробовать сыграть в две игры 1994 и 1995 – две первые серии WarCraft' \
                 '([Orcs & Humans](https://dos.zone/warcraft-orcs-humans/) и [Tides of Darkness](https://dos.zone/warcraft-ii-tides-of-darkness/)). ' \
                 '\nПочему? Во-первых, эти игры запускаются прямо из браузера и не требуют установки. Во-вторых, это начало культовой серии игр и ' \
                 'отличный пример развития гейм-дизайнерской мысли. В-третьих, игровой мир – это место, где Ваши ученики проводят много времени. ' \
                 'И последнее. Компьютерные игры создаются таким образом, чтобы увлечь игрока и создать уникальный игровой опыт. ' \
                 'Попробуйте под этим углом взглянуть на планирование уроков.\n\n' \
                 '_Персонализированная часть_\n'
zyfra_1 = '1️⃣ Мини-курс из 7 видео о работе с презентациями, электронными таблицами и Яндекс.документами [Rutude](https://rutube.ru/plst/343173/)\n' \
          '2️⃣ [Инструкция по работе с Telegram](https://telegra.ph/Telegram-instrukciya-11-20). Как открыть веб-версию, не пренебрегая персональной информацией, ' \
          'и несколько полезных советов\n' \
          '3️⃣ Найти интересную и полезную для работы информацию можно, максимально точно и подробно сформулировав вопрос' \
          ' – большие языковые модели помогут быстро и вполне надежно. Потестируйте\n1)	[GigaChat](https://developers.sber.ru/gigachat) или ' \
          '[Telegram бот](t.me/gigachat_bot),\n2)	«Нейро» - сервис для поиска от [Яндекса](https://ya.ru/n/about)\n3)	или бесплатную версию ChatGPT, ' \
          'доступную на российской деловой платформе – [TenChat](https://tenchat.ru)' \
          '\nнапример, спросите – «Напиши план дидактической игры, которую можно предложить подросткам для изучения темы «Типы рельефов»'
zyfra_2 = '1️⃣ Умение быстро и корректно набирать тексты на компьютере или телефоне становится критически важным для экономии ценного учительского времени. Потренироваться можно [играючи](https://klavogonki.ru) ' \
          '(есть словари по отдельным книгам).' \
          '\n2️⃣ Но важно не только быстро набирать текст, но и быстро искать его. В этом могут помочь поисковые операторы Яндекса, [инструкция](https://telegra.ph/Poiskovye-operatory-YAndeksa-09-23)' \
          '\n3️⃣ Вы умете быстро разделять, переворачивать страницы и соединять pdf-файлы? ' \
          'А распознавать текст на сканах? Как делать это просто: [Rutube](https://rutube.ru/video/81cc05edbe9dbba8260d8029f01bfcec/)'
zyfra_3 = '1️⃣ [Открытая часть курса](https://kids.kaspersky.ru/metodic/information-security-7th-grade) от лаборатории Касперского «Основы информационной безопасности». Сейчас доступна программа для 7 класса, но при этом он достаточно сложный для освоения и ' \
          'абсолютно полезен всем\n2️⃣ Подкаст "Эксперто Патронум", [выпуск "Цифровой педдизайн"](https://teachbase.mave.digital/ep-18). ' \
          'Педагогический дизайн – новый термин для процесса планирования обучения, однако он маркирует появление новых сущностей образования ' \
          'с использованием «цифры». В этом подкасте приводятся замечательные примеры, и точно что-то можно взять себе на заметку' \
          '\n3️⃣ Современные открытые источники существенно усложняют проверку учителем фактических знаний учеников, тем более, что общественное мнение ' \
          'всё время твердит «лучше уметь думать, чем много знать». Современному педагогу нужно быть готовым к тому, что ребёнок может списать очень ' \
          'просто. Посмотрите, как работают поисковые системы нового типа: [perplexity.ai](https://www.perplexity.ai/)  и [«Нейро» от Яндекса](https://ya.ru/?neuro=1&npr=1) ' \
          '. Краткая [инструкция](https://telegra.ph/Primer-raboty-s-perplexityai-i-nejro-yandeksom-06-07) ' \
          '\nНо не только тексты словесных ответов под угрозой. Изучите возможности интерфейса [WolframAlpha](https://www.wolframalpha.com/).' \
          'Сервис может помочь как с задачками по химии, так и с решением практически любых школьных математических задач.'

method_preamble = '📚 *МЕТОДИКА*\n\nКажется, «наше всё» - это методика преподавания. В педагогике систематизация всевозможных методик сложно реализуема.' \
                  '\n\n_Общие рекомендации_\n✨ Рекомендуем всем книгу Джона Хэтти «Видимое обучение для учителей». В выводах и применении метаанализа можно усомниться, ' \
                  'но прочитать точно стоит. Книга раскрывает эффективные методики и дает очень толковые рекомендации.' \
                  '\n✨Не только педагоги бьются над огранкой методики обучения, тем же озабочены и разработчики игр. ' \
                  'Предлагаем небольшое развлекательное видео о том, как в компьютерных играх делают [обучение](https://yandex.ru/video/preview/4145119881307407784)' \
                  '\n\n_Персонализированная часть_\n'

method_1 = '1️⃣ Совсем недавно вышел учебник «Основы педагогики и психологии» для 10-11 педагогических классов. Получилось настолько нескучно и классно, что рекомендуем его к прочтению и опытным учителям. ' \
           'Для учебника также есть отличное [цифровое дополнение](https://lecta.ru/mix/playlist-pedagogic/index.html)' \
           ' и [примерная рабочая программа](https://vk.com/wall-175662532_1691). А также на досуге можно послушать ' \
           'одного из авторов – известного учёного-педагога Казакову Елену Ивановну [«Есть ли педагогическая одарённость?»](https://vk.com/video-175662532_456239132)' \
           '\n2️⃣ Гуманная педагогика Шалвы Амонашвили, беседа в рамках [«Встречи лидеров школьного образования»](https://www.youtube.com/live/PecUUTPxCL4?si=_7A6dEDIGwCW8nHV&t=1831)' \
           '\n3️⃣ Набор и пример использования полезных техник по разрешению комплексных задач, например, планирование групповой работы школьников. Кратко, но емко [пост в TG](https://t.me/mos_cnppm/56)'
method_2 = '1️⃣ [Плейлист](https://vk.com/video/playlist/-179950459_17 ) конкурных уроков с "Учителя года - 2023". ' \
           'Можно на досуге поставить фоном, вдруг от опыта других какие-то идеи появятся интересные.' \
           '\n2️⃣ Книга-аналитика ["Педагогический дизайн: Российская и зарубежная исследовательская повестка"](https://ioe.hse.ru/pubs/share/direct/593673038.pdf). Самое интересное' \
           ' – обзор иностранных подходов к педагогическому дизайну. К сожалению, платный курс по педагогическому дизайну от этого же автора. ' \
           'Доступен на площадке ["Открытое образование"](https://openedu.ru/course/hse/PEDDESIGN/)' \
           '\n3️⃣ «А где у него талант» – цитата из [подкаста Сферума](https://vk.com/podcast-203504769_456239095). Интересный разговор о том, как помочь найти путь, ' \
           'ну или не мешать его найти.'
method_3 = '1️⃣ [Книга](https://vk.com/wall14838841_11308) Василия Васильевича Давыдова "Теория развивающего обучения". Особенно рекомендуем вторую часть: "Психическое развитие ' \
           'школьников в учебной деятельности"' \
           '\n2️⃣ Джесси Шелл "Гейм-дизайн". В образовании много говорят о геймификации. Но геймификация – это не просто перевести ' \
           'урок в игровую форму, но создать новый опыт и вовлечь в деятельность. Книга Джесси Шелла – это самые основы моделирования опыта «игрока», ' \
           'поддержания интереса с помощью сбалансированной кривой роста сложности и других полезных педагогу инструментов.' \
           '\n3️⃣ Работа учителя – это работа на будущее, результаты ее видны не сразу. А значит нужно заботливо и дотошно продумывать, «как учить». ' \
           'Небольшой [текст](https://t.me/mos_cnppm/50) про стратегическое планирование образовательного процесса.'

psy_ped_preamble = '👩‍🏫 *ПСИХОЛОГО-ПЕДАГОГИЧЕСКАЯ*\n\nНаша работа напрямую связана с людьми и осложнена тем, что это ещё маленькие люди, не всегда способные понять себя, свои эмоции и желания. ' \
                   'А уж тем более – желания другого. Особенно важно понимать процессы становления личности в подростковом периоде со всеми его «сложностями».' \
                   '\n\n_Общие рекомендации_\n✨ Ознакомтесь с [кейсами Форума "Мы - команда" 2023 г.](https://t.me/mos_cnppm/104)' \
                   '\n✨ Мировая культура сейчас полна непрекращающегося подросткового бунта, кишит примерами «взгляда со стороны подростков». ' \
                   'Но, наверное, самое яркое –  “Another brick in the wall”. Посмотрите [клип](https://vk.com/video12668965_161371828) – кажется, он ' \
                   'отлично отражает главные страхи и бунт подростков прошлых поколений, хоть и в утрированной форме. Но отражает ли он тревоги и страхи ' \
                   'нынешних подростков? Полные текст и перевод можно прочитать [здесь](https://www.amalgama-lab.com/songs/p/pink_floyd/another_brick_in_the_wall.html)' \
                   '\n\n_Персонализированная часть_\n'
psy_ped_1 = '1️⃣ Педагогическая работа включает в себя понимание учащегося, в том числе его эмоций, чувств и актуального состояния. ' \
            'К сожалению, если с ребёнком общаются нечасто, ему крайне тяжело самому понять, что он чувствует. Непростая задача «сочувствовать» ' \
            'ученикам осложняется. В практике рефлексии может помочь «колесо эмоций» Роберта Плутчика – это очень удобная систематизация и соотношения ' \
            'слов и понятий в чувственной сфере. Коллеги из Тольятти сделали прекрасную [памятку](http://ddut.tgl.ru/sp/pic/File/Metod/PRO/Buklet_1.pdf)' \
            '\n2️⃣ Попробуйте определить, какие эмоции и на какие темы проявляют молодые люди в выпуске [подкаста «Собака съела дневник»](https://music.yandex.ru/album/6987707/track/88475216). ' \
            'Заодно и новомодную лексику можно освоить.' \
            '\n3️⃣ «Найти общий язык с детьми –  звучит как задание партии» - хорошая [серия подкаста Сферум](https://vk.com/podcast-203504769_456239084). ' \
            'Рассуждения о понимании друг друга и общении между разными поколениями.'
psy_ped_2 = '1️⃣ НИУ ВШЭ ведут лонгитьюдное исследование школьной неуспешности. Некоторые результаты приведены в [статье](https://edexpert.ru/shkolnaya-neuspeshnost?ysclid=lqgkg9v275921106234). ' \
            'После немного затянутого вступления прицельно рассматриваются некоторые факторы. Например, родительский стресс и саморегуляция.' \
            '\n2️⃣ Во ФГОСе есть группа регулятивных учебных действий, туда входят планирование, контроль, прогнозирование и другие качества, которые очень сложно развить, если не вести постоянные ' \
            'записи о себе. Заменив бумажный дневник на электронный, мы много чего выиграли, но потеряли один важный навык – умение вести дневник и оформлять разговор с самим собой. ' \
            'А ведь личные дневники позволяют наблюдать за собой, своим ростом. Они позволяют оценивать, что нравится, а что нет. Особенно важно это в периоды активного погружения в социум. ' \
            'В этой статье РБК хорошо классифицированы типы [дневников](https://style.rbc.ru/life/5cdae1039a7947a611287486). ' \
            '\nА проект «Прожито» позволяет проиллюстрировать важность их ведения. Например, ' \
            '[Дневник учителя-словесника](https://corpus.prozhito.org/note/338419), [Школьника](https://corpus.prozhito.org/note/475695)' \
            '\nСтоит рассказать о полезных свойствах личного дневника на классном часе, предложить им попробовать?' \
            '\n3️⃣ В теории привязанности есть понятие «значимый взрослый». Работая в школе, мы постоянно находимся на виду у учеников и часто становимся для кого-то таким взрослым. ' \
            'Что это за роль? В 2020 году студентами МПГУ было проведено исследование в «Лицее Вторая школа» среди 6-7 классов. ' \
            'С результатами можно познакомиться [здесь](https://cyberleninka.ru/article/n/obraz-znachimogo-vzroslogo-v-predstavleniyah-sovremennyh-podrostkov/viewer). ' \
            'Более специфическая тематика исследования у коллег [из Томска](https://cyberleninka.ru/article/n/novaya-model-znachimogo-vzroslogo-vo-vnutrisemeynyh-otnosheniyah-po-materialam-sovremennoy-rossiyskoy-prozy-dlya-detey-i-podrostkov/viewer)' \
            ', здесь неплохой обзор литературы, да и познакомиться с моделями семьи, которые предлагает современная подростковая литература, полезно.'
psy_ped_3 = '1️⃣ История становления современной российской системы образования во многом связана с деятельностью Надежды Крупской и Антона Макаренко. Нижеприведённые материалы помогут понять систему образования лучше, увидеть истоки тех или иных решений. Видео-лекция ["Крупская - величайший педагог XX века"](https://www.culture.ru/live/broadcast/50617/n-k-krupskaya-velichaishii-pedagog-khkh-veka) ' \
            'и коротенькая [статья о А. С. Макаренко](https://diletant.media/articles/45347609/) помогут посмотреть на психолого-педагогическое сопровождение совсем с другой стороны и возможно — для совсем других задач.' \
            '\n2️⃣ Проблема профориентации и обучения профессиям актуальна всегда. О современных инструментах и подходах можно послушать в подкасте "Эксперто Патронум", ' \
            'выпуск ["Профориентация и Edtech"](https://teachbase.mave.digital/ep-22)' \
            '\n3️⃣ Где есть «интересы бизнеса» и можно понять про роль профессии в социальном статусе. В подкасте РБК [«Скиллсет профессионала: как думать о' \
            ' себе на языке навыков»](https://music.yandex.ru/album/11944020/track/90381349?dir=desc&activeTab=track-list) говорится о навыках взрослых, однако интересно поразмышлять об этой теме в контексте учащихся, их профориентации и общего результата обучения.'

comm_preamble = '💬*КОММУНИКАЦИЯ*\n\nЕсли рассматривать коммуникацию в широком диапазоне действий, то для успеха нужен целый ворох навыков: и эффективное общение, ' \
                'и эмпатия, и стресс-, конфликт-, тайм-менеджмент. В общем, количество инструментов, необходимых для успешного и продуктивного командного ' \
                'взаимодействия очень велико, владение ими требует от каждого участника взаимодействия. Умение выстраивать общение с большим ' \
                'количеством разных людей, ещё не умеющих это делать, часто связывают с педагогическим даром и таким магическим качеством, как «любовь к детям».' \
                '\n\n_Общие рекомендации_\n✨Коммуникативная компетенция развивается в общении, через участие в профессиональных кружках и соцсетях. ' \
                'В Москве такие объединения представлены САМП, ЕНАП и локальными кружками. ' \
                'Рекомендуем заглянуть или даже влиться в одно из них.' \
                '\nА ещё очень помогают правильно настроенные мессенджеры и телефоны. Вы можете отключать уведомления на время, назначать разные звуки на разные чаты, отправлять отложенные сообщения.' \
                '\n✨В качестве развлечения предлагаем познакомиться с игрой для мобильных устройств, практически полностью построенной на переписках ' \
                'сыщика и подростков, – An Elwood Trail. Оригинальная игра на английском языке, однако существует множество переводчиков приложений, например, ' \
                'Bubble Screen Translate, которые вполне позволяют играть с переводом на русский язык.' \
                '\n\n_Персонализированная часть_\n'

comm_1 = '1️⃣ Обобщающая и всеохватывающая, но немного поверхностная статья [«Коммуникативные навыки педагога: что это такое и как их развивать»](https://prof-sferum.ru/teacher_communication_skills) от Сферум' \
         ' - хорошее изложение базы, которую нужно знать всем.' \
         '\n2️⃣ В статье [«Правила деловой переписки»](https://skillbox.ru/media/management/pravila-delovoy-perepiski-kak-obshchatsya-s-kollegami-rukovoditelyami-i-podchinyennymi/)' \
         ' приведены базовые правила письменной коммуникации. С примерами.' \
         '\n3️⃣ А в статье [«Как учителю общаться с учениками в школе и за её пределами»](https://prof-sferum.ru/kak-obchatsya-s-uchenikami) посвящена важной теме – удержанию границ при общении с учениками. ' \
         'Статья тоже очень базовая, но даёт повод для размышлений.'

comm_2 = '1️⃣ Один из подходов работы с конфликтами в школе – школьные службы примирения. ' \
         'У адепта такого подхода Антона Коновалова есть практическое руководство, особенно полезно ознакомиться с ' \
         'блоком [«V Коммуникация» (стр.175)](https://vk.cc/cxT3SM)' \
         '\n2️⃣ Как избежать токсичности в чатах учителей, родителей и учеников в материале [Сферума](https://prof-sferum.ru/toxicornot). ' \
         'Они могут показаться очевидными, но иногда именно из-за очевидных правил случаются самые жестокие конфликты.' \
         '\n3️⃣ Простая и понятная памятка о работе с персональными данными в виде изображения. [Сохраните себе](https://disk.yandex.ru/i/FOCB7QL9UBl8Kg)'

comm_3 = '1️⃣ Очень популярная книга «Пиши, сокращай». ' \
         'О том как донести свою мысль до аудитории.' \
         '\n2️⃣ Отлично структурированный [материал](https://habr.com/ru/companies/agima/articles/695582/) о  конфликтах, единственный минус - примеры про программистов.' \
         '\n3️⃣ Небольшой бесплатный курс (~3 ч) о публичных выступлениях. Обратите внимание на ' \
         'Часть 5 «Питчинг» - вероятно так, наши ученики будут представлять свои проекты. [Платформа «Знание»](https://akademiya.znanierussia.ru/course/effektivnye-peregovory-i-iskusstvo-argumentacii/)'

yr_preamble = '📜*ПРАВОВАЯ*\n\nУ каждого участника образовательных отношений есть права, обязанности и возможности. Однако трактовка нормативных документов требует ' \
              'определённой сноровки и опыта, а также понимания правил применения и работы с документами.' \
              '\n\n_Общие рекомендации_\n✨Мы рекомендуем ознакомиться с ФЗ от 29.12.2012 «Об образовании в Российской Федерации», ' \
              'Профессиональными стандартами педагога, воспитателя педагога-психолога и  т.д., локальными актами своей образовательной организации, а также с Трудовым кодексом. ' \
              '([Tут](http://оиро.рф/wp-content/uploads/2020/01/Normativnye-dokumenty-reglamentirujushhie-deyatelnost-pedagogov.pdf) неплохой перечень – всего-то 28 страниц ' \
              'ссылок на документы).\nНо ' \
              'следить и практиковаться в отдельных аспектах образовательного права можно в группе [«Школа права МГПУ»](https://vk.com/pravomgpu)' \
              '\nВ качестве введения рекомендуем пройти бесплатный курс от Яндекс.Учебника ' \
              '[«Права Учителя»](https://yandex.ru/project/education/course/prava-uchitelya)\n\n_Персонализированная часть_\n'

yr_1 = '1️⃣ Конституция Российской Федерации прекрасный документ. Предлагаем сконцентрировать внимание на преамбуле и 43 статье Конституции. ' \
       'Здесь главные ценностные ориентиры нашей деятельности (учебной и воспитательной).\
       	\n2️⃣ У педагогов есть права и свободы – о них нужно прочитать в 47 статье ФЗ-273 "Об Образовании".' \
       '\n3️⃣ Сравните эти два текста: 1 – [статья о «народном» представлении](https://school.kontur.ru/publications/2435) и о педагоге (хоть и с опорой на ' \
       'нормативную документацию); 2 – профессиональный ' \
       '[стандарт педагога](https://profstandart.rosmintrud.ru/obshchiy-informatsionnyy-blok/natsionalnyy-reestr-professionalnykh-standartov/reestr-professionalnykh-standartov/index.php?ELEMENT_ID=56367). ' \
       '\nКак Вы думаете, много ли между ними отличий?'
yr_2 = '1️⃣ Сейчас реализуются два, касающихся школы, Национальных проекта: «Образование» (до 31.12.2024) и ' \
       '«Демография» (в части общественного здоровья и приобщения к спорту). Познакомиться со всеми национальными проектами' \
       ' можно [тут](https://национальныепроекты.рф/projects/)' \
       '\nА детальнее взглянуть на Нацпроект [«Образование» здесь](https://национальныепроекты.рф/projects/obrazovanie) - ' \
       'достаточно четко сформулированы государственные цели, что поможет в составлении планов и программ.' \
       '\n2️⃣ Послушать и посмотреть качественный обзор на современную систему госуправления образованиям можно в записи ' \
       'вебинара  ["Управление образованием: как это всё работает?"](https://rutube.ru/video/a1413eaf486137db0ec6ce7f45c5b7b2/)' \
       '\n3️⃣ [Памятка по ФЗ 273 «Об образовании» для педагогов](https://disk.yandex.ru/i/cWjKzmVrohyp1Q) (пожалуйста, проверяйте актуальность сведений)' \

yr_3 = '1️⃣ [Нормативные основания](https://disk.yandex.ru/i/voLy-ShV3qQd0A) работы с персональными данными в формате `pdf`.' \
       '\n2️⃣ Высший пилотаж: «А как регламентируют образование в СНГ?» [Модальные законы и законы об образовании государств-участников](https://youthlib.mirea.ru/ru/collection_books/4/56) (все на русском языке).' \
       '\n3️⃣ Для московского образования есть, помимо вышеперечисленных, ещё один очень важный документ – ' \
       '[Отраслевое соглашение между Департаментом образования и науки и Московского городской организацией Общероссийского' \
       ' Профсоюза образования](https://mgoprof.ru/wp-content/uploads/2023/03/Aktualizirovannaya%20redakciya%20Otraslevogo%20soglasheniya%20na%202023-2025%20gody.pdf). ' \
       'В этом документе перечислены обязанности Департамента и Профсоюза в областях обеспечения условий труда, занятости и повышения квалификации. ' \
       'Можно узнать про дистанционную работу, про оплату труда и про кадровый резерв.'